Lenti84/VdMot_Controller/software_esp32/src/stmApp.cpp
                int8_t idx=findTempID(arg0ptr);
                if (idx>=0) {
                    memset(temps[idx].id,0x0,sizeof(temps[idx].id)); 
                    strncpy(temps[idx].id,arg0ptr,sizeof(temps[idx].id));
                    int16_t cValue=atoi(arg1ptr);
                    temps[idx].temperature=ConvertCF(cValue)+VdmConfig.configFlash.tempsConfig.tempConfig[idx].offset;
                } 
                tempIndex++;
                if (tempIndex>=tempsCount) {  // all temp sensors read
                    tempIndex=0;
                    //tempsCount=tempsPrivCount;
                }
            }
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }

        else if(memcmp(APP_PRE_GETVERSION,cmd,5) == 0) {
            if(argcnt > 0) {
                VdmSystem.stmVersion=arg0ptr; 
                VdmSystem.stmBuild=0;
            }
            if(argcnt > 1) {
                 VdmSystem.stmBuild=atoi(arg1ptr);
            }
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }

        else if(memcmp(APP_PRE_GETONEWIRESETT,cmd,5) == 0) {
            if(argcnt == 3) {
                setSensorIndex(atoi(arg0ptr),arg1ptr,arg2ptr);
            }
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"one wire settings data "+String(arg1ptr));
                }   
                uint8_t nItems= atoi(arg0ptr);
                if (nItems>0) {
                    char* cmdptr;
                    char* ps=arg1ptr;
                    for (uint8_t idx=0; idx<nItems;idx++) {
                        if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                        strncpy(arg4ptr,ps,sizeof(arg4));
                        if (cmdptr!=NULL) ps=cmdptr+1;
                        if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                        strncpy(arg5ptr,ps,sizeof(arg5));
                        setSensorIndex(idx,arg4ptr,arg5ptr);
                        if (cmdptr!=NULL) ps=cmdptr+1;
                        idx++;
                    }
                }
                
            }
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }
        
        else if(memcmp(APP_PRE_SETONEWIRESEARCH,cmd,5) == 0) {
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }

        else if(memcmp(APP_PRE_SETLEARNMOVEM,cmd,5) == 0) {
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }

        else if(memcmp(APP_PRE_GETLEARNMOVEM,cmd,5) == 0) {
            if(argcnt == 1) {
                learnAfterMovements=atoi(arg0ptr);
            }
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }

        else if(memcmp(APP_PRE_SETVLVSENSOR,cmd,5) == 0) {
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }

        else if(memcmp(APP_PRE_SETALLVLVOPEN,cmd,5) == 0) {
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }

        else if(memcmp(APP_PRE_SETVLLEARN,cmd,5) == 0) {
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }

        else if(memcmp(APP_PRE_SETMOTCHARS,cmd,5) == 0) {
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }

        else if(memcmp(APP_PRE_GETMOTCHARS,cmd,5) == 0) {
            if(argcnt == 2) {
                motorChars.maxLowCurrent=atoi(arg0ptr);
                motorChars.maxHighCurrent=atoi(arg1ptr);
            }
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
        }
        cmd_buffer="";
    }
}

void  CStmApp::app_comm_machine()
{
    char sendbuffer[30];
    char valbuffer[10];

    static unsigned int cnt_alive = COMM_ALIVE_CYCLE;
        
    static unsigned int timeout = 0;
    static unsigned int retry = 0;
   
    switch(commstate) {

        case COMM_IDLE: 
                commstate = COMM_ALIVE;
                break;

        case COMM_ALIVE: 
                if (cnt_alive) {
                    cnt_alive = COMM_ALIVE_CYCLE;
                    UART_STM32.println("ESPalive");
                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_INFO, "ESPalive");
                    }
                }
                else cnt_alive--;

                retry = 5;
                commstate = COMM_SENDTARGET;

                break;

        // send target position values
        case COMM_SENDTARGET:
                commstate = COMM_GETDATA;
                for (uint8_t x=0; x<ACTUATOR_COUNT; x++) {
                    if (VdmConfig.configFlash.valvesConfig.valveConfig[x].active) {
                        // check if target has changed
                        if(target_position_mirror[x] != actuators[x].target_position)
                        {
                            if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                                syslog.log(LOG_DEBUG, "valve position has changed : "+String(x)+" = "+String(actuators[x].target_position));
                            }
                            memset(sendbuffer,0x0,sizeof(sendbuffer));
                            strcat(sendbuffer, APP_PRE_SETTARGETPOS);
                            strcat(sendbuffer, " ");

                            itoa(x, valbuffer, 10);
                            strcat(sendbuffer, valbuffer);
                            strcat(sendbuffer, " ");   

                            itoa(actuators[x].target_position, valbuffer, 10);      
                            strcat(sendbuffer, valbuffer);
                            strcat(sendbuffer, " ");

                            UART_STM32.println(sendbuffer);
                            UART_DBG.println("valve position has changed : "+String(x)+" = "+String(actuators[x].target_position));
                            // break loop, next valve will be served in next cycle
                            break;

